Revit 2024 API
ExportPatternTableIterator Class
 An iterator to a set of Pattern table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ExportPatternTableIterator : IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
Visual Basic
Public Class ExportPatternTableIterator _
	Implements IEnumerator(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo))
Visual C++
public ref class ExportPatternTableIterator : IEnumerator<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportPatternTableIterator
See Also
ExportPatternTableIterator Members
Autodesk.Revit.DB Namespace